app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(params[:appointment])
    @appointment.start_time = params[:start_time]
    @appointment.end_time = params[:end_time]
    @appointment.user_id = current_user.id
    if @appointment.save
---
INSERT INTO `appointments` (`end_time`, `created_at`, `updated_at`, `user_id`, `description`, `start_time`) VALUES('2010-06-04 20:35:00', '2010-06-23 00:19:11', '2010-06-23 00:19:11', NULL, 'hjjkhk kj khkjhk kjhkjh', '2010-06-24 20:30:00')