app/controllers/notes_controller.rb

SELECT * FROM `notes` WHERE (`notes`.`id` = 1)
---
  def show
    @note = Note.find(params[:id])

INSERT INTO `notes` (`created_at`, `title`, `body`, `updated_at`, `user_id`) VALUES('2010-06-23 00:18:32', '', '<p>\r\n	<strong>This is some stuff</strong></p>\r\n<p>\r\n	and I like it</p>\r\n', '2010-06-23 00:18:32', NULL)
---
  def create
    @note = Note.new(params[:note])
    @note.user_id = current_user.id
    if @note.save