app/controllers/to_dos_controller.rb

INSERT INTO `to_dos` (`start_date`, `list`, `created_at`, `updated_at`, `user_id`) VALUES('2010-06-26', 'Build a house', '2010-06-25 01:37:31', '2010-06-25 01:37:31', NULL)
---
  def create
    @todo = ToDo.new(params[:to_do])
    @todo.start_date = params[:start_date]
    @todo.user_id = current_user.id
    @todo.date = Time.now.to_date
    if @todo.save