app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`address`, `city`, `single_access_token`, `zip`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `last_requested_at`, `last_name`, `persistence_token`, `login_count`, `last_login_ip`, `last_login_at`, `first_name`, `email`, `state`) VALUES(NULL, NULL, 'WNJAUFgY7HMWnPkoFC73', '30034', '2010-06-20 06:08:15', 'de1ff6a2b2f13b77908bd7787a9f477b0303f3f71b572be155aeb5ed1474f5ebf66e26bffadc4bc20b77e35c3d3892aa589035350da7c5d2b3c2e7b9206b18d2', 'mOAbskXMFxWVy72gZTyD', '2010-06-20 06:08:15', 0, '127.0.0.1', 'hV3QD4jtkUdIa-7d-JOh', NULL, 'Thomas', 'c4754df19bfd302f6e597431d183db15b27fb930201c34a9c325bbfb7edfe471aa937435104380eac8a86ecd936aa031e6af62bc5f7f0b16687c73879a718386', 1, NULL, NULL, 'Michael', 'mthomas@yahoo.com', NULL)